InformationRegisters/ДействиеСкидокНаценок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ДействиеСкидокНаценок</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДействияСкидок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СегментПартнеров</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыПартнеров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыКартЛояльности</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкидкаНаценка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкидкиНаценки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыДействияСкидок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>СтатусыДействияСкидок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Действует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеДействует</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/СТ_Обработчики/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Обработчик подписки на событие СТ_КлючПоискаОбъектПоискаПриЗаписи.
// 	Формирует ключ поиска и записывает его в СТ_КлючиПоиска
//
Процедура СТ_КлючПоискаОбъектПоискаПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СТ_ОбщегоНазначения.ОбновитьКлючПоискаДляОбъектов(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Источник.Ссылка),
		Отказ);
	
КонецПроцедуры
	
// Обработчик подписки на событие СТ_КлючПоискаАналогиПриЗаписи.
// 	Формирует ключ поиска и записывает его в СТ_КлючиПоиска
//
Процедура СТ_КлючПоискаАналогиПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	масОбъектов = Новый Массив;
	
	ОтборПоНоменклатуре = Источник.Отбор.Найти("Номенклатура");
	Если ОтборПоНоменклатуре = Неопределено Тогда
		
		Для каждого Запись Из Источник Цикл
			Если ЗначениеЗаполнено(Запись.Номенклатура) Тогда
				масОбъектов.Добавить(Запись.Номенклатура);	    		
			КонецЕсли; 	
		КонецЦикла;		
		
	Иначе
		
		Если ЗначениеЗаполнено(ОтборПоНоменклатуре.Значение) Тогда
			масОбъектов.Добавить(ОтборПоНоменклатуре.Значение);	
		КонецЕсли;	
	
	КонецЕсли; 
	
	 
	СТ_ОбщегоНазначения.ОбновитьКлючПоискаДляОбъектов(
		масОбъектов,
		Отказ);
		
	// При изменении аналогов номенклатуры необходимо повторно провести по ней выгрузку данных на сайт
	Для каждого ТоварСсылка Из масОбъектов Цикл
		ОбменССайтомСобытия.ОбменССайтомПриЗаписиОбъектаПриЗаписи(ТоварСсылка, Отказ);	
	КонецЦикла; 	
		
КонецПроцедуры	

// Обработчик подписки на событие СТ_СкидкиНаценкиПриЗаписи.
// 	Определяет, может ли являться записываемая скидка - скидкой по производителю
//
Процедура СТ_СкидкиНаценкиПриЗаписиПриЗаписи(Источник, Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДействиеСкидокНаценок.Источник КАК Соглашение
		|ИЗ
		|	РегистрСведений.ДействиеСкидокНаценок КАК ДействиеСкидокНаценок
		|ГДЕ
		|	ДействиеСкидокНаценок.СкидкаНаценка = &СкидкаНаценка
		|	И ДействиеСкидокНаценок.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДействияСкидок.Действует)
		|	И ДействиеСкидокНаценок.Источник <> ЗНАЧЕНИЕ(Справочник.СоглашенияСКлиентами.ПустаяСсылка)
		|	И ДействиеСкидокНаценок.Источник ССЫЛКА Справочник.СоглашенияСКлиентами";
		
		
	Запрос.УстановитьПараметр("СкидкаНаценка", Источник.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСоглашенийПоСкидке = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаСоглашенийПоСкидке.Следующий() Цикл
		
		СТ_ОбщегоНазначения.ОбновитьСкидкиПоСоглашению(ВыборкаСоглашенийПоСкидке.Соглашение, Отказ);	
		
	КонецЦикла;			
	
КонецПроцедуры

Процедура СТ_ДействиеСкидокНаценокПриЗаписиПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если Источник.Количество() = 0 тогда
		Возврат;
	КонецЕсли;	
	
	Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Источник.Отбор, "Источник") тогда
		Соглашение = Источник.Отбор["Источник"].Значение;
	Иначе
		Возврат;
	КонецЕсли; 	
	
	СТ_ОбщегоНазначения.ОбновитьСкидкиПоСоглашению(Соглашение, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

 
 

#КонецОбласти
